In [1]:
import pandas as pd

In [2]:
gameplay = pd.read_csv('User Gameplay data.csv')
withdraw = pd.read_csv('Withdrawal Data.csv')
deposit = pd.read_csv('Deposit Data.csv')

In [3]:
deposit.set_index('Datetime', inplace=True)

In [4]:
deposit = deposit.rename(columns={'Amount': 'Deposit Amount'})

In [5]:
deposit

                  User Id  Deposit Amount
Datetime
01-10-2022 0:03       357            2000
01-10-2022 0:03       776            2500
01-10-2022 0:06       492            5000
01-10-2022 0:07       803            5000
01-10-2022 0:09       875            1500
...                   ...             ...
31-10-2022 23:57      654            1200
31-10-2022 23:58      980             200
31-10-2022 23:58        2           40000
31-10-2022 23:58      612            2800
31-10-2022 23:59      786           20000

[17438 rows x 2 columns]

In [6]:
total_deposit= deposit.groupby('User Id').agg({'Deposit Amount': 'sum'}).reset_index()

In [7]:
num_times_deposit = deposit.groupby('User Id').size().reset_index(name='no. of times deposit money')

In [8]:
deposit_data= pd.merge(total_deposit, num_times_deposit, on='User Id')

In [9]:
deposit_data

     User Id  Deposit Amount  no. of times deposit money
0          1            5000                           1
1          2          567000                          20
2          3           40000                           4
3          4            1750                           1
4          5           74100                          67
..       ...             ...                         ...
910      994            1400                           1
911      995           34500                           5
912      996           96400                          31
913      998            7400                           5
914      999            9000                           3

[915 rows x 3 columns]

In [12]:
deposit_data['no. of times deposit money'].sum()

17438

#

# Part A - Calculating loyalty points

# 3. What is the average deposit amount?

# 5492.185399701801

In [13]:
avg_deposit = deposit_data['Deposit Amount'].sum()/17438

In [14]:
avg_deposit

5492.185399701801

#

# 4. What is the average deposit amount per user in a month?

In [15]:
deposit_data['Average deposit amount per user'] = deposit_data['Deposit Amount'] / 31

In [16]:
deposit_data #Avg deposit amount per user

,User Id,Deposit Amount,no. of times deposit money,Average deposit amount per user
0,1,5000,1,161.290323
1,2,567000,20,18290.322581
2,3,40000,4,1290.322581
3,4,1750,1,56.451613
4,5,74100,67,2390.322581
...,...,...,...,...
910,994,1400,1,45.161290
911,995,34500,5,1112.903226
912,996,96400,31,3109.677419
913,998,7400,5,238.709677
914,999,9000,3,290.322581

#

# 5. What is the average number of games played per user?

# 355.266

In [18]:
gameplay.set_index('Datetime', inplace=True)

In [20]:
games_played= gameplay.groupby('User ID').size().reset_index(name='No. of games played by user')

In [21]:
games_played

     User ID  No. of games played by user
0          0                           15
1          1                            8
2          2                           97
3          3                           80
4          4                            5
..       ...                          ...
995      995                           18
996      996                          474
997      997                          109
998      998                            4
999      999                          174

[1000 rows x 2 columns]

In [22]:
avg_games_played = games_played['No. of games played by user'].sum()/1000

In [23]:
avg_games_played

355.266

#